mogrtou/qemu-imxrt1180/hw/net/imxrt1180_enet.c
/*
 * QEMU model of i.MX RT1180 ENET Ethernet MAC Controller
 *
 * Copyright (c) 2026
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Reference: NXP i.MX RT1180 Reference Manual, ENET chapter
 *            NXP i.MX ENET/FEC common register layout
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/net/imxrt1180_enet.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "migration/vmstate.h"
#include "qemu/main-loop.h"
#include "exec/address-spaces.h"

/* ------------------------------------------------------------------ */
/*  Forward declarations                                                */
/* ------------------------------------------------------------------ */
static uint64_t imxrt1180_enet_read(void *opaque, hwaddr addr, unsigned size);
static void imxrt1180_enet_write(void *opaque, hwaddr addr, uint64_t val,
                                 unsigned size);
static void imxrt1180_enet_reset(DeviceState *dev);
static void imxrt1180_enet_realize(DeviceState *dev, Error **errp);
static void imxrt1180_enet_class_init(ObjectClass *oc, void *data);
static void imxrt1180_enet_instance_init(Object *obj);
static void imxrt1180_enet_update_irq(IMXRT1180ENETState *s);
static void enet_handle_rx(IMXRT1180ENETState *s);
static void enet_handle_tx(IMXRT1180ENETState *s);

/* ------------------------------------------------------------------ */
/*  MDIO Frame Handling (MMFR register)                                 */
/* ------------------------------------------------------------------ */
static void enet_handle_mdio_write(IMXRT1180ENETState *s)
{
    uint32_t mmfr = s->mmfr;
    uint8_t phy_addr = (mmfr >> 23) & 0x1F;
    uint8_t reg_addr = (mmfr >> 18) & 0x1F;
    uint8_t op = (mmfr >> 28) & 0x3;
    uint16_t data = mmfr & 0xFFFF;

    if (op == 0x1) { /* Write operation */
        imxrt1180_dp83822_phy_mdio_write(&s->phy, reg_addr, data);
    }

    /* Clear MII event, set MII complete */
    s->eir |= ENET_INT_MII;
    imxrt1180_enet_update_irq(s);
}

static void enet_handle_mdio_read(IMXRT1180ENETState *s)
{
    uint32_t mmfr = s->mmfr;
    uint8_t reg_addr = (mmfr >> 18) & 0x1F;
    uint16_t data;

    data = imxrt1180_dp83822_phy_mdio_read(&s->phy, reg_addr);

    /* Update MMFR DATA field with read result */
    s->mmfr = (mmfr & 0xFFFF0000) | data;

    /* Set MII complete */
    s->eir |= ENET_INT_MII;
    imxrt1180_enet_update_irq(s);
}

/* ------------------------------------------------------------------ */
/*  Interrupt Logic                                                     */
/* ------------------------------------------------------------------ */
static void imxrt1180_enet_update_irq(IMXRT1180ENETState *s)
{
    bool pending = (s->eir & s->eimr) != 0;
    qemu_set_irq(s->irq, pending ? 1 : 0);
}

/* ------------------------------------------------------------------ */
/*  Register Read Dispatch                                              */
/* ------------------------------------------------------------------ */
static uint64_t imxrt1180_enet_read(void *opaque, hwaddr addr, unsigned size)
{
    IMXRT1180ENETState *s = IMXRT1180_ENET(opaque);
    uint32_t val = 0;

    switch (addr) {
    case ENET_ECR:
        val = s->ecr;
        break;
    case ENET_EIR:
        val = s->eir;
        break;
    case ENET_EIMR:
        val = s->eimr;
        break;
    case ENET_RDAR:
        val = s->rdar;
        break;
    case ENET_TDAR:
        val = s->tdar;
        break;
    case ENET_ECR_MAGIC:
        val = s->ecr_magic;
        break;
    case ENET_MMFR:
        val = s->mmfr;
        break;
    case ENET_MSCR:
        val = s->mscr;
        break;
    case ENET_MIBC:
        val = s->mibc;
        break;
    case ENET_RCR:
        val = s->rcr;
        break;
    case ENET_TCR:
        val = s->tcr;
        break;
    case ENET_PALR:
        val = s->palr;
        break;
    case ENET_PAUR:
        val = s->paur;
        break;
    case ENET_OPD:
        val = s->opd;
        break;
    case ENET_IAUR:
        val = s->iaur;
        break;
    case ENET_IALR:
        val = s->ialr;
        break;
    case ENET_GAUR:
        val = s->gaur;
        break;
    case ENET_GALR:
        val = s->galr;
        break;
    case ENET_TFWR:
        val = s->tfwr;
        break;
    case ENET_RDSR:
        val = s->rdsr;
        break;
    case ENET_TDSR:
        val = s->tdsr;
        break;
    case ENET_MRBR:
        val = s->mrbr;
        break;
    case ENET_RSFL:
        val = s->rsfl;
        break;
    case ENET_RSEM:
        val = s->rsem;
        break;
    case ENET_RAEM:
        val = s->raem;
        break;
    case ENET_RAFL:
        val = s->rafl;
        break;
    case ENET_TSEM:
        val = s->tsem;
        break;
    case ENET_TAEM:
        val = s->taem;
        break;
    case ENET_TAFL:
        val = s->tafl;
        break;
    case ENET_TIPG:
        val = s->tipg;
        break;
    case ENET_ATCR:
    case ENET_ATVR:
    case ENET_ATOFF:
    case ENET_ATPER:
    case ENET_ATCOR:
    case ENET_ATINC:
    case ENET_ATSTMP:
    case ENET_TGSR:
    case ENET_TCSR0:
    case ENET_TCCR0:
    case ENET_TCSR1:
    case ENET_TCCR1:
    case ENET_TCSR2:
    case ENET_TCCR2:
    case ENET_TCSR3:
    case ENET_TCCR3:
        /* IEEE 1588 read-as-zero in Phase 1 */
        val = 0;
        break;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: unimplemented register read: offset 0x%04" HWADDR_PRIx
                      " size %u\n", __func__, addr, size);
        val = 0;
        break;
    }

    return val;
}

/* ------------------------------------------------------------------ */
/*  Register Write Dispatch                                             */
/* ------------------------------------------------------------------ */
static void imxrt1180_enet_write(void *opaque, hwaddr addr, uint64_t val,
                                 unsigned size)
{
    IMXRT1180ENETState *s = IMXRT1180_ENET(opaque);

    switch (addr) {
    case ENET_ECR:
        /* ECR write-protect: only update if magic was unlocked.
         * After a successful write the magic is consumed. */
        if (s->ecr_magic == ENET_ECR_MAGIC_VAL) {
            s->ecr = val;
            s->ecr_magic = 0;

            /* Soft reset: clear ECR_RESET and restore default state */
            if (val & ENET_ECR_RESET) {
                s->ecr &= ~(uint32_t)ENET_ECR_RESET;
                /* Full reset via device_class_set_parent_reset handles
                 * register defaults; this only clears the trigger bit. */
            }
        }
        break;

    case ENET_EIR:
        /* EIR is Write-1-to-Clear (W1C) */
        s->eir &= ~(uint32_t)val;
        imxrt1180_enet_update_irq(s);
        break;

