mogrtou/qemu-imxrt1180/hw/net/imxrt1180_enet.c
    case ENET_EIMR:
        s->eimr = val;
        imxrt1180_enet_update_irq(s);
        break;

    case ENET_RDAR:
        s->rdar = val;
        /* Writing 1 activates RX BD ring scanning */
        if (val & 1) {
            enet_handle_rx(s);
        }
        break;

    case ENET_TDAR:
        s->tdar = val;
        /* Writing 1 activates TX BD ring scanning */
        if (val & 1) {
            enet_handle_tx(s);
        }
        break;

    case ENET_ECR_MAGIC:
        s->ecr_magic = val;
        break;

    case ENET_MMFR:
    {
        uint8_t op = (val >> 28) & 0x3;

        s->mmfr = val;

        /* Dispatch based on MMFR OP field:
         *   01 = MDIO Write
         *   10 = MDIO Read
         */
        if (op == 0x1) {
            enet_handle_mdio_write(s);
        } else if (op == 0x2) {
            enet_handle_mdio_read(s);
        }
        break;
    }

    case ENET_MSCR:
        s->mscr = val;
        break;

    case ENET_MIBC:
        s->mibc = val;
        break;

    case ENET_RCR:
        s->rcr = val;
        break;

    case ENET_TCR:
        s->tcr = val;
        break;

    case ENET_PALR:
        s->palr = val;
        break;

    case ENET_PAUR:
        s->paur = val;
        break;

    case ENET_OPD:
        s->opd = val;
        break;

    case ENET_IAUR:
        s->iaur = val;
        break;

    case ENET_IALR:
        s->ialr = val;
        break;

    case ENET_GAUR:
        s->gaur = val;
        break;

    case ENET_GALR:
        s->galr = val;
        break;

    case ENET_TFWR:
        s->tfwr = val;
        break;

    case ENET_RDSR:
        /* RDSR is read-only: hardware sets this from the RX BD ring */
        qemu_log_mask(LOG_GUEST_ERROR,
                      "imxrt1180_enet: write to read-only RDSR\n");
        break;

    case ENET_TDSR:
        s->tdsr = val;
        break;

    case ENET_MRBR:
        s->mrbr = val;
        break;

    case ENET_RSFL:
        s->rsfl = val;
        break;

    case ENET_RSEM:
        s->rsem = val;
        break;

    case ENET_RAEM:
        s->raem = val;
        break;

    case ENET_RAFL:
        s->rafl = val;
        break;

    case ENET_TSEM:
        s->tsem = val;
        break;

    case ENET_TAEM:
        s->taem = val;
        break;

    case ENET_TAFL:
        s->tafl = val;
        break;

    case ENET_TIPG:
        s->tipg = val;
        break;

    /* IEEE 1588 registers: silently ignore in Phase 1 */
    case ENET_ATCR:
    case ENET_ATVR:
    case ENET_ATOFF:
    case ENET_ATPER:
    case ENET_ATCOR:
    case ENET_ATINC:
    case ENET_ATSTMP:
    case ENET_TGSR:
    case ENET_TCSR0:
    case ENET_TCCR0:
    case ENET_TCSR1:
    case ENET_TCCR1:
    case ENET_TCSR2:
    case ENET_TCCR2:
    case ENET_TCSR3:
    case ENET_TCCR3:
        break;

    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: unimplemented register write: offset 0x%04" HWADDR_PRIx
                      " size %u val 0x%08" PRIx64 "\n",
                      __func__, addr, size, val);
        break;
    }
}

/* ------------------------------------------------------------------ */
/*  Memory Region Ops                                                   */
/* ------------------------------------------------------------------ */
static const MemoryRegionOps imxrt1180_enet_ops = {
    .read = imxrt1180_enet_read,
    .write = imxrt1180_enet_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
    .impl = {
        .min_access_size = 4,
        .max_access_size = 4,
    },
    .valid = {
        .min_access_size = 4,
        .max_access_size = 4,
    },
};

/* ------------------------------------------------------------------ */
/*  BD DMA Engine — Guest RAM access helpers                            */
/* ------------------------------------------------------------------ */

/**
 * enet_bd_read: Read a Buffer Descriptor from guest RAM.
 * @bd_ptr: physical address of the 8-byte BD
 * @bd:    pointer to local BD structure (output)
 *
 * BD layout (little-endian, 8 bytes packed):
 *   [15:0]  status  (R/E, W, L, etc.)
 *   [31:16] length  (data length)
 *   [63:32] data_ptr (buffer physical address)
 */
static void enet_bd_read(hwaddr bd_ptr, IMXRT1180ENETBD *bd)
{
    uint32_t words[2];

    cpu_physical_memory_read(bd_ptr, words, sizeof(words));

    /* BD is stored LE by hardware; on LE host this is native. */
    bd->status   = le16_to_cpu((uint16_t)(words[0] & 0xFFFF));
    bd->length   = le16_to_cpu((uint16_t)((words[0] >> 16) & 0xFFFF));
    bd->data_ptr = le32_to_cpu(words[1]);
}

/**
 * enet_bd_write: Write BD status/length fields back to guest RAM.
 * Preserves the data_ptr field (read-modify-write).
 */
static void enet_bd_write(hwaddr bd_ptr, const IMXRT1180ENETBD *bd)
{
    uint32_t words[2];

    /* Read current data_ptr */
    cpu_physical_memory_read(bd_ptr, words, sizeof(words));

    /* Update status and length */
    words[0] = (uint32_t)le16_to_cpu(bd->status)
             | ((uint32_t)le16_to_cpu(bd->length) << 16);

    /* Preserve data_ptr */
    words[1] = le32_to_cpu(bd->data_ptr);

    cpu_physical_memory_write(bd_ptr, words, sizeof(words));
}

/**
 * enet_bd_write_full: Write complete BD (status + length + data_ptr)
 */
static void enet_bd_write_full(hwaddr bd_ptr, const IMXRT1180ENETBD *bd)
{
    uint32_t words[2];

    words[0] = (uint32_t)le16_to_cpu(bd->status)
             | ((uint32_t)le16_to_cpu(bd->length) << 16);
    words[1] = le32_to_cpu(bd->data_ptr);

    cpu_physical_memory_write(bd_ptr, words, sizeof(words));
}

/**
 * enet_next_bd_index: Advance BD index, wrapping at ring boundary.
 * @curr:   current BD index
 * @bd:     the BD just processed (to check W bit)
 * @ring_size: total number of BDs in the ring
 * @return: next BD index
 */
static int32_t enet_next_bd_index(int32_t curr, const IMXRT1180ENETBD *bd,
                                   uint32_t ring_size)
{
    if (bd->status & ENET_BD_TX_W) {
        return 0;  /* Wrap to start */
    }
    return (curr + 1) % (int32_t)ring_size;
}

