mogrtou/qemu-imxrt1180/hw/net/imxrt1180_enet.c
/* ------------------------------------------------------------------ */
/*  TX Path: BD Ring → QEMU Net Backend                                 */
/* ------------------------------------------------------------------ */

/**
 * enet_do_tx_bd: Process a single TX Buffer Descriptor.
 *
 * Reads the data buffer from guest RAM and sends it via qemu_send_packet.
 * Returns true if another BD should be processed.
 */
static bool enet_do_tx_bd(IMXRT1180ENETState *s)
{
    hwaddr bd_addr, buf_addr;
    IMXRT1180ENETBD bd;
    uint8_t tx_buf[2048];
    uint16_t length;

    if (!s->tdsr) {
        /* No TX ring base set */
        return false;
    }

    bd_addr = s->tdsr + (hwaddr)s->tx_curr * sizeof(IMXRT1180ENETBD);
    enet_bd_read(bd_addr, &bd);

    /* Check if BD is owned by ENET (Ready bit set by firmware) */
    if (!(bd.status & ENET_BD_TX_R)) {
        return false;  /* No more ready TX BDs */
    }

    length = bd.length;
    if (length > sizeof(tx_buf)) {
        length = sizeof(tx_buf);
    }

    buf_addr = bd.data_ptr;
    if (buf_addr && length > 0) {
        cpu_physical_memory_read(buf_addr, tx_buf, length);
    }

    /* Send to QEMU network backend (TAP / SLIRP) */
    if (s->nic && length > 0) {
        qemu_send_packet(qemu_get_queue(s->nic), tx_buf, length);
    }

    /* Update BD: clear Ready, preserve wrap/last bits */
    bd.status &= ~(uint16_t)ENET_BD_TX_R;

    enet_bd_write(bd_addr, &bd);

    /* Check for wrap */
    s->tx_curr = enet_next_bd_index(s->tx_curr, &bd, s->tx_ring_size);

    /* Set TXF interrupt */
    s->eir |= ENET_INT_TXF;
    imxrt1180_enet_update_irq(s);

    return true;
}

/**
 * enet_handle_tx: Process all pending TX Buffer Descriptors.
 * Called when firmware writes TDAR=1.
 */
static void enet_handle_tx(IMXRT1180ENETState *s)
{
    int max_iter = s->tx_ring_size + 1;

    while (max_iter-- > 0) {
        if (!enet_do_tx_bd(s)) {
            break;
        }
    }
}

/* ------------------------------------------------------------------ */
/*  RX Path: QEMU Net Backend → BD Ring → Guest RAM                     */
/* ------------------------------------------------------------------ */

/**
 * enet_can_receive_bd: Check if at least one RX BD is available (Empty).
 */
static bool enet_can_receive_bd(IMXRT1180ENETState *s)
{
    hwaddr bd_addr;
    IMXRT1180ENETBD bd;

    if (!s->rdsr || s->rx_ring_size == 0) {
        return false;
    }

    bd_addr = s->rdsr + (hwaddr)s->rx_curr * sizeof(IMXRT1180ENETBD);
    enet_bd_read(bd_addr, &bd);

    return (bd.status & ENET_BD_RX_E) != 0;
}

/**
 * enet_handle_rx: Check RX ring for phantom frames (Phase 1: no-op).
 * The actual RX path is driven by incoming packets from the net backend.
 * This function is called on RDAR to notify that the ring is active.
 */
static void enet_handle_rx(IMXRT1180ENETState *s)
{
    (void)s;  /* Phase 1: RX is backend-driven, no polling needed */
}

/* ------------------------------------------------------------------ */
/*  Network Backend Callbacks                                            */
/* ------------------------------------------------------------------ */
static int imxrt1180_enet_can_receive(NetClientState *nc)
{
    IMXRT1180ENETState *s = qemu_get_nic_opaque(nc);

    return enet_can_receive_bd(s) ? 1 : 0;
}

static ssize_t imxrt1180_enet_receive(NetClientState *nc, const uint8_t *buf,
                                      size_t size)
{
    IMXRT1180ENETState *s = qemu_get_nic_opaque(nc);
    hwaddr bd_addr, buf_addr;
    IMXRT1180ENETBD bd;
    size_t copy_len;

    if (!s->rdsr || s->rx_ring_size == 0) {
        return 0;
    }

    if (size > s->max_frame_size) {
        return 0;  /* Drop oversized frame */
    }

    bd_addr = s->rdsr + (hwaddr)s->rx_curr * sizeof(IMXRT1180ENETBD);
    enet_bd_read(bd_addr, &bd);

    /* BD must be empty (owned by ENET) */
    if (!(bd.status & ENET_BD_RX_E)) {
        /* No empty BD — set RXB interrupt, drop frame */
        s->eir |= ENET_INT_RXB;
        imxrt1180_enet_update_irq(s);
        return 0;
    }

    /* Copy frame data into guest buffer */
    copy_len = (size < s->mrbr) ? size : s->mrbr;
    buf_addr = bd.data_ptr;

    if (buf_addr && copy_len > 0) {
        cpu_physical_memory_write(buf_addr, buf, copy_len);
    }

    /* Update BD: clear Empty, set Last, write length */
    bd.status &= ~(uint16_t)ENET_BD_RX_E;
    bd.status |= ENET_BD_RX_L;
    bd.length = (uint16_t)size;

    enet_bd_write(bd_addr, &bd);

    /* Advance RX ring */
    s->rx_curr = enet_next_bd_index(s->rx_curr, &bd, s->rx_ring_size);

    /* Set RXF interrupt */
    s->eir |= ENET_INT_RXF;
    imxrt1180_enet_update_irq(s);

    return (ssize_t)size;
}

static void imxrt1180_enet_cleanup(NetClientState *nc)
{
    /* No-op */
}

static NetClientInfo net_imxrt1180_enet_info = {
    .type = NET_CLIENT_DRIVER_NIC,
    .size = sizeof(NICState),
    .can_receive = imxrt1180_enet_can_receive,
    .receive = imxrt1180_enet_receive,
    .cleanup = imxrt1180_enet_cleanup,
};

/* ------------------------------------------------------------------ */
/*  Device Reset                                                        */
/* ------------------------------------------------------------------ */
static void imxrt1180_enet_reset(DeviceState *dev)
{
    IMXRT1180ENETState *s = IMXRT1180_ENET(dev);

    s->ecr = ENET_ECR_RESET_VAL;
    s->eir = 0x00000000;
    s->eimr = 0x00000000;
    s->rdar = 0x00000000;
    s->tdar = 0x00000000;
    s->ecr_magic = 0x00000000;
    s->mmfr = 0x00000000;
    s->mscr = 0x00000040;
    s->mibc = 0xC0000000;
    s->rcr = ENET_RCR_RESET_VAL;
    s->tcr = ENET_TCR_RESET_VAL;
    s->palr = 0x00000000;
    s->paur = 0x00008808;
    s->opd = 0x00010001;
    s->iaur = 0x00000000;
    s->ialr = 0x00000000;
    s->gaur = 0x00000000;
    s->galr = 0x00000000;
    s->tfwr = 0x00000000;
    s->rdsr = 0x00000000;
    s->tdsr = 0x00000000;
    s->mrbr = 0x00000000;
    s->rsfl = 0x00000000;
    s->rsem = 0x00000000;
    s->raem = 0x00000004;
    s->rafl = 0x00000004;
    s->tsem = 0x00000060;
    s->taem = 0x00000008;
    s->tafl = 0x00000008;
    s->tipg = 0x0000000C;

    /* IEEE 1588 registers */
    s->atcr = 0x00000000;
    s->atvr = 0x00000000;
    s->atoff = 0x00000000;
    s->atper = 0x00000000;
    s->atcor = 0x00000000;
    s->atinc = 0x00000000;
    s->atstmp = 0x00000000;
    s->tgsr = 0x00000000;
    memset(s->tcsr, 0, sizeof(s->tcsr));
    memset(s->tccr, 0, sizeof(s->tccr));

