mogrtou/qemu-imxrt1180/hw/net/imxrt1180_enet.c
    /* TX/RX ring */
    s->tx_curr = 0;
    s->rx_curr = 0;

    /* PHY */
    imxrt1180_dp83822_phy_reset(&s->phy);

    imxrt1180_enet_update_irq(s);
}

/* ------------------------------------------------------------------ */
/*  Device Realize                                                      */
/* ------------------------------------------------------------------ */
static void imxrt1180_enet_realize(DeviceState *dev, Error **errp)
{
    IMXRT1180ENETState *s = IMXRT1180_ENET(dev);

    /* Initialize MMIO region */
    memory_region_init_io(&s->iomem, OBJECT(dev), &imxrt1180_enet_ops, s,
                          TYPE_IMXRT1180_ENET, 0x1000);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);

    /* Initialize interrupt */
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);

    /* Initialize network backend */
    qemu_macaddr_default_if_unset(&s->conf.macaddr);
    memcpy(s->macaddr, s->conf.macaddr.a, 6);

    s->nic = qemu_new_nic(&net_imxrt1180_enet_info, &s->conf,
                          object_get_typename(OBJECT(dev)),
                          dev->id, s);

    qemu_format_nic_info_str(qemu_get_queue(s->nic), s->macaddr);
}

/* ------------------------------------------------------------------ */
/*  Properties                                                          */
/* ------------------------------------------------------------------ */
static Property imxrt1180_enet_properties[] = {
    DEFINE_PROP_UINT8("phy-addr", IMXRT1180ENETState, phy_addr, 0),
    DEFINE_PROP_UINT32("tx-ring-size", IMXRT1180ENETState, tx_ring_size, 8),
    DEFINE_PROP_UINT32("rx-ring-size", IMXRT1180ENETState, rx_ring_size, 8),
    DEFINE_PROP_UINT32("max-frame-size", IMXRT1180ENETState, max_frame_size,
                       1522),
    DEFINE_NIC_PROPERTIES(IMXRT1180ENETState, conf),
};

/* ------------------------------------------------------------------ */
/*  VMState Migration                                                   */
/* ------------------------------------------------------------------ */
static const VMStateDescription vmstate_imxrt1180_enet = {
    .name = TYPE_IMXRT1180_ENET,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32(ecr, IMXRT1180ENETState),
        VMSTATE_UINT32(eir, IMXRT1180ENETState),
        VMSTATE_UINT32(eimr, IMXRT1180ENETState),
        VMSTATE_UINT32(rdar, IMXRT1180ENETState),
        VMSTATE_UINT32(tdar, IMXRT1180ENETState),
        VMSTATE_UINT32(ecr_magic, IMXRT1180ENETState),
        VMSTATE_UINT32(mmfr, IMXRT1180ENETState),
        VMSTATE_UINT32(mscr, IMXRT1180ENETState),
        VMSTATE_UINT32(mibc, IMXRT1180ENETState),
        VMSTATE_UINT32(rcr, IMXRT1180ENETState),
        VMSTATE_UINT32(tcr, IMXRT1180ENETState),
        VMSTATE_UINT32(palr, IMXRT1180ENETState),
        VMSTATE_UINT32(paur, IMXRT1180ENETState),
        VMSTATE_UINT32(opd, IMXRT1180ENETState),
        VMSTATE_UINT32(iaur, IMXRT1180ENETState),
        VMSTATE_UINT32(ialr, IMXRT1180ENETState),
        VMSTATE_UINT32(gaur, IMXRT1180ENETState),
        VMSTATE_UINT32(galr, IMXRT1180ENETState),
        VMSTATE_UINT32(tfwr, IMXRT1180ENETState),
        VMSTATE_UINT32(rdsr, IMXRT1180ENETState),
        VMSTATE_UINT32(tdsr, IMXRT1180ENETState),
        VMSTATE_UINT32(mrbr, IMXRT1180ENETState),
        VMSTATE_UINT32(rsfl, IMXRT1180ENETState),
        VMSTATE_UINT32(rsem, IMXRT1180ENETState),
        VMSTATE_UINT32(raem, IMXRT1180ENETState),
        VMSTATE_UINT32(rafl, IMXRT1180ENETState),
        VMSTATE_UINT32(tsem, IMXRT1180ENETState),
        VMSTATE_UINT32(taem, IMXRT1180ENETState),
        VMSTATE_UINT32(tafl, IMXRT1180ENETState),
        VMSTATE_UINT32(tipg, IMXRT1180ENETState),
        VMSTATE_INT32(tx_curr, IMXRT1180ENETState),
        VMSTATE_INT32(rx_curr, IMXRT1180ENETState),
        VMSTATE_END_OF_LIST()
    },
};

/* ------------------------------------------------------------------ */
/*  QOM Type Registration                                               */
/* ------------------------------------------------------------------ */
static void imxrt1180_enet_class_init(ObjectClass *oc, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(oc);

    dc->realize = imxrt1180_enet_realize;
    dc->reset = imxrt1180_enet_reset;
    dc->vmsd = &vmstate_imxrt1180_enet;
    set_bit(DEVICE_CATEGORY_NETWORK, dc->categories);
    device_class_set_props(dc, imxrt1180_enet_properties);
}

static void imxrt1180_enet_instance_init(Object *obj)
{
    /* Nothing to initialize at instance creation time */
}

static const TypeInfo imxrt1180_enet_info = {
    .name = TYPE_IMXRT1180_ENET,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(IMXRT1180ENETState),
    .instance_init = imxrt1180_enet_instance_init,
    .class_init = imxrt1180_enet_class_init,
};

static void imxrt1180_enet_register_types(void)
{
    type_register_static(&imxrt1180_enet_info);
}

type_init(imxrt1180_enet_register_types)
